In [36]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import os

In [37]:
os.chdir('/home/user/KPMG/KPMG1')

In [38]:
df=pd.read_csv('Customerdemographic.csv')

In [39]:
df.head()

,Note: The data and information in this document is reflective of a hypothetical situation and client. This document is to be used for KPMG Virtual Internship purposes only.,Unnamed: 1,Unnamed: 2,Unnamed: 3,Unnamed: 4,Unnamed: 5,Unnamed: 6,Unnamed: 7,Unnamed: 8,Unnamed: 9,Unnamed: 10,Unnamed: 11,Unnamed: 12
0,720,Darrel,Canet,Male,67,1931-10-23,Recruiting Manager,Retail,Affluent Customer,N,1;DROP TABLE users,No,6
1,1092,Katlin,Creddon,Female,56,1935-08-22,VP Quality Control,Retail,Mass Customer,N,ì¬íê³¼íì ì´íì°êµ¬ì,No,5
2,3410,Merrili,Brittin,Female,93,1940-09-22,NaN,Property,Mass Customer,N,á,No,16
3,2413,Abbey,Murrow,Male,27,1943-08-11,Environmental Specialist,Manufacturing,High Net Worth,N,á,Yes,17
4,658,Donn,Bonnell,Male,38,1944-01-24,Tax Accountant,Manufacturing,Affluent Customer,N,ì¬íê³¼íì ì´íì°êµ¬ì,Yes,8

In [40]:
df.rename(columns={'Note: The data and information in this document is reflective of a hypothetical situation and client. This document is to be used for KPMG Virtual Internship purposes only':'Customerid'},inplace=True)

In [41]:
df

,Note: The data and information in this document is reflective of a hypothetical situation and client. This document is to be used for KPMG Virtual Internship purposes only.,Unnamed: 1,Unnamed: 2,Unnamed: 3,Unnamed: 4,Unnamed: 5,Unnamed: 6,Unnamed: 7,Unnamed: 8,Unnamed: 9,Unnamed: 10,Unnamed: 11,Unnamed: 12
0,720,Darrel,Canet,Male,67,1931-10-23,Recruiting Manager,Retail,Affluent Customer,N,1;DROP TABLE users,No,6
1,1092,Katlin,Creddon,Female,56,1935-08-22,VP Quality Control,Retail,Mass Customer,N,ì¬íê³¼íì ì´íì°êµ¬ì,No,5
2,3410,Merrili,Brittin,Female,93,1940-09-22,NaN,Property,Mass Customer,N,á,No,16
3,2413,Abbey,Murrow,Male,27,1943-08-11,Environmental Specialist,Manufacturing,High Net Worth,N,á,Yes,17
4,658,Donn,Bonnell,Male,38,1944-01-24,Tax Accountant,Manufacturing,Affluent Customer,N,ì¬íê³¼íì ì´íì°êµ¬ì,Yes,8
...,...,...,...,...,...,...,...,...,...,...,...,...,...
3996,3779,Ulick,Daspar,U,68,NaN,NaN,IT,Affluent Customer,N,NaN,No,NaN
3997,3883,Nissa,Conrad,U,35,NaN,Legal Assistant,IT,Mass Customer,N,NaN,No,NaN
3998,3931,Kylie,Epine,U,19,NaN,NaN,IT,High Net Worth,N,NaN,Yes,NaN
3999,3935,Teodor,Alfonsini,U,72,NaN,NaN,IT,High Net Worth,N,NaN,Yes,NaN
4000,3998,Sarene,Woolley,U,60,NaN,Assistant Manager,IT,High Net Worth,N,NaN,No,NaN

In [42]:
df['Unnamed: 3'].unique()

array(['Male', 'Female', 'F', 'Femal', 'M', 'U', 'gender'], dtype=object)

In [43]:
df['Unnamed: 3'].sort_values()

13           F
872      Femal
1326    Female
1645    Female
3145    Female
         ...
3936         U
3935         U
3944         U
4000         U
3913    gender
Name: Unnamed: 3, Length: 4001, dtype: object

In [44]:
df['Unnamed: 3'].value_counts()

Female    2037
Male      1872
U           88
Femal        1
F            1
gender       1
M            1
Name: Unnamed: 3, dtype: int64

In [45]:
df['Unnamed: 3'].count()

4001

In [46]:
df['Unnamed: 6'].value_counts()

Business Systems Development Analyst    45
Social Worker                           44
Tax Accountant                          44
Internal Auditor                        42
Legal Assistant                         41
                                        ..
Research Assistant III                   3
Health Coach III                         3
Health Coach I                           3
Developer I                              1
job_title                                1
Name: Unnamed: 6, Length: 196, dtype: int64

In [47]:
df['Unnamed: 9'].value_counts()

N                     3998
Y                        2
deceased_indicator       1
Name: Unnamed: 9, dtype: int64

In [48]:
df1=pd.read_csv('Transactions.csv')

In [49]:
df1.head()

,Note: The data and information in this document is reflective of a hypothetical situation and client. This document is to be used for KPMG Virtual Internship purposes only.,Unnamed: 1,Unnamed: 2,Unnamed: 3,Unnamed: 4,Unnamed: 5,Unnamed: 6,Unnamed: 7,Unnamed: 8,Unnamed: 9,Unnamed: 10,Unnamed: 11,Unnamed: 12
0,transaction_id,product_id,customer_id,transaction_date,online_order,order_status,brand,product_line,product_class,product_size,list_price,standard_cost,product_first_sold_date
1,1,2,2950,2/25/2017,FALSE,Approved,Solex,Standard,medium,medium,71.49,$53.62,41245
2,2,3,3120,5/21/2017,TRUE,Approved,Trek Bicycles,Standard,medium,large,2091.47,$388.92,41701
3,3,37,402,10/16/2017,FALSE,Approved,OHM Cycles,Standard,low,medium,1793.43,$248.82,36361
4,4,88,3135,8/31/2017,FALSE,Approved,Norco Bicycles,Standard,medium,medium,1198.46,$381.10,36145

In [50]:
df1['Unnamed: 5'].value_counts()

Approved        19821
Cancelled         179
order_status        1
Name: Unnamed: 5, dtype: int64

In [51]:
df1['Unnamed: 5'].isnull().sum()

0

In [52]:
df1['Unnamed: 4'].value_counts()

TRUE            9829
FALSE           9811
online_order       1
Name: Unnamed: 4, dtype: int64

In [53]:
df1['Unnamed: 4'].isnull().sum()

360

In [54]:
df1['Unnamed: 6'].isnull().sum()

197

In [59]:
df1.rename(columns={'Unnamed: 1':'product_id'},{'Unnamed: 2':'customer_id'},{'Unnamed: 3':'transaction_date'},
          {'Unnamed: 4':'online_order'},{'Unnamed: 5':'order_status'},{'Unnamed: 6':'brand'},{'Unnamed: 7':'product_line'},
          {'Unnamed: 8':'product_class'},{'Unnamed: 9':'product_size'},{'Unnamed: 10':'list_price'},{'Unnamed: 11':'standard_cost'},
          {'Unnamed: 12':'product_first_solid_date'},inplace=True)

SyntaxError: positional argument follows keyword argument (<ipython-input-59-70adecaf6aa2>, line 1)

In [61]:
df1.head()

,Note: The data and information in this document is reflective of a hypothetical situation and client. This document is to be used for KPMG Virtual Internship purposes only.,Unnamed: 1,Unnamed: 2,Unnamed: 3,Unnamed: 4,Unnamed: 5,Unnamed: 6,Unnamed: 7,Unnamed: 8,Unnamed: 9,Unnamed: 10,Unnamed: 11,Unnamed: 12
0,transaction_id,product_id,customer_id,transaction_date,online_order,order_status,brand,product_line,product_class,product_size,list_price,standard_cost,product_first_sold_date
1,1,2,2950,2/25/2017,FALSE,Approved,Solex,Standard,medium,medium,71.49,$53.62,41245
2,2,3,3120,5/21/2017,TRUE,Approved,Trek Bicycles,Standard,medium,large,2091.47,$388.92,41701
3,3,37,402,10/16/2017,FALSE,Approved,OHM Cycles,Standard,low,medium,1793.43,$248.82,36361
4,4,88,3135,8/31/2017,FALSE,Approved,Norco Bicycles,Standard,medium,medium,1198.46,$381.10,36145

In [62]:
df1['Unnamed: 7'].isnull().sum()

197

In [63]:
df1['Unnamed: 7'].isnull().sum()

197